000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаПродюсеры/КафкаПродюсеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КафкаПродюсеры</name>
  <attributes>
    <name>Брокер</name>
    <type>
      <types>CatalogRef.КафкаБрокеры</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимАсинх</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПакетнуюПубликацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыПродюсера</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаПродюсеры/Forms/ФормаЭлемента/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// инициализация нового
	Если Объект.Ссылка.Пустая() И Не Объект.РежимАсинх Тогда
		Ключи = ОбщегоНазначения.ВыгрузитьКолонку(Объект.ПараметрыПродюсера, "Ключ");
		Для Каждого ПараметрОтправки Из СтандартныеПараметрыКонсьюмера() Цикл
			Если Ключи.Найти(ПараметрОтправки.Ключ) = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(Объект.ПараметрыПродюсера.Добавить(), ПараметрОтправки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	// инициализация параметров
	СвойстваLibrdKafka = КафкаИнтеграцияСлужебныйПовтИсп.СвойстваLibrdKafka("P");
	ЗаполнитьЗначенияПредставления();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьЗначенияПредставления();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьЗначенияПредставления();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимАсинхПриИзменении(Элемент)
	
	ПараметрыОтправки = СтандартныеПараметрыКонсьюмера();
	
	Ключи = КлючиПараметровПродюсера();
	Для Каждого ПараметрОтправки Из ПараметрыОтправки Цикл
		Если Объект.РежимАсинх Тогда
			ВерхнаяяГраница = Объект.ПараметрыПродюсера.Количество() - 1;
			Для Итератор = 0 по ВерхнаяяГраница Цикл
				Если ПараметрыОтправки.Получить(Объект.ПараметрыПродюсера[ВерхнаяяГраница - Итератор].Ключ) <> Неопределено Тогда
					Объект.ПараметрыПродюсера.Удалить(ВерхнаяяГраница - Итератор);
				КонецЕсли;
			КонецЦикла;
		
		Иначе
			Если Ключи.Найти(ПараметрОтправки.Ключ) = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(Объект.ПараметрыПродюсера.Добавить(), ПараметрОтправки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыПродюсера

&НаКлиенте
Процедура ПараметрыПродюсераПриАктивизацииСтроки(Элемент)
	
	КафкаИнтеграцияСлужебныйКлиент.ПараметрыПодключенияПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПродюсераПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	КафкаИнтеграцияСлужебныйКлиент.ПараметрыПодключенияПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование,
		Родитель, ЭтоГруппа, Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПродюсераКлючПриИзменении(Элемент)
	
	КафкаИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПродюсераКлючНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	КафкаИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора,
		ВыборДобавлением, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПродюсераКлючАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	КафкаИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючАвтоПодбор(ЭтотОбъект, Элемент, Текст, ДанныеВыбора,
		ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПродюсераЗначениеПредставлениеПриИзменении(Элемент)
	
	КафкаИнтеграцияСлужебныйКлиент.ПараметрыПодключенияЗначениеПредставлениеПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПараметрыПродюсераЗначениеПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	КафкаИнтеграцияСлужебныйКлиент.ПараметрыПодключенияЗначениеПредставлениеНачалоВыбора(ЭтотОбъект, Элемент,
		ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСтандартныеПараметрыПродюсера(Команда)
	
	Объект.ПараметрыПродюсера.Очистить();
	
	Для Каждого Параметр Из СтандартныеПараметрыКонсьюмера() Цикл
		НоваяСтрока = Объект.ПараметрыПродюсера.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметр);
		НоваяСтрока.ЗначениеПредставление = Параметр.Значение;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция КлючиПараметровПродюсера()
	
	Результат = Новый Массив;
	Для Каждого ПараметрОтправки Из Объект.ПараметрыПродюсера Цикл
		Результат.Добавить(ПараметрОтправки.Ключ);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтандартныеПараметрыКонсьюмера()
	
//	см. Обработка.КафкаИнтеграция.ОтправитьСообщение()
	
	Результат = Новый Соответствие;
	Результат.Вставить("message.timeout.ms", 5000); // с этим параметром поакуратнее	
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЗначенияПредставления()
	
	Если СвойстваLibrdKafka = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Объект.ПараметрыПродюсера Цикл // ТекущийОбъект
		
		Свойство = СвойстваLibrdKafka.Получить(Строка.Ключ); // см. КафкаИнтеграцияСлужебный.НовоеОписаниеСвойстваLibrdKafka
		ТипЗначения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Свойство, "ТипЗначения");
		Строка.ЗначениеПредставление = ?(ТипЗначения = "int" Или ТипЗначения = "float",
			СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строка.Значение), Строка.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
